Rails Backend/lets_go/app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE (username = 'larry@example.com' OR email = 'larry@example.com') ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    user = User.find_by("username = ? OR email = ?", params[:username_or_email], params[:username_or_email])