Rails Backend/lets_go/app/controllers/statuses_controller.rb

INSERT INTO "statuses" ("user_id", "lat", "long", "body", "duration", "image_url", "created_at", "updated_at", "id") VALUES (NULL, 'MyString', 'MyString', 'MyString', 1, 'MyString', '2014-06-15 20:39:37', '2014-06-15 20:39:37', 980190962)
INSERT INTO "users" ("name", "username", "email", "password_digest", "created_at", "updated_at", "id") VALUES ('Joe User', 'joe_user', 'joe_user@example.com', '$2a$10$wJTPdvpGgzDvkXChrcPyqOQrFFawzGu89B1rZze/lVIcJKWiNeAqS', '2014-06-15 20:39:37', '2014-06-15 20:39:37', 633107804)
---
  def create
    user_id = UserLookup.find_user_id_by_token(token)
    status = StatusCreator.create(params[:status], user_id)

SELECT "statuses".* FROM "statuses" WHERE (user_id != )
SELECT "statuses".* FROM "statuses"
---
  def list
    #statuses = Status.where("user_id != #{current_user.id}")
    statuses = Status.where('created_at > ?', 10.minutes.ago)

    responses = statuses.map do |status|