Rails Backend/lets_go/app/controllers/users_controller.rb

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)